from django.http import HttpResponse
  

ranobe_list = [
    ["Мастера меча онлайн", 2009, "Япония", "Рэки Кавахара", 8.3],
    ["Тёмный дворецкий", 2006, "Япония", "Янаги Ацуси", 7.9],
    ["Магическая битва", 2018, "Япония", "Гэге Акутами", 8.5],
    ["Сказания о демонах и богах", 2015, "Китай", "Маджунь", 8.0],
    ["Реинкарнация безработного", 2014, "Япония", "Касумидзу Токинори", 8.2],
    ["Путь слияния", 2015, "Япония", "Синъити Кавасэ", 7.8],
    ["Семь смертных грехов", 2012, "Япония", "Накаба Сузуки", 8.1],
    ["Мир без конца", 2017, "Япония", "Тогэ Мицука", 7.7],
    ["Токийский гуль", 2011, "Япония", "Суэйсэ Ишида", 8.4],
    ["Охотник на монстров", 2015, "Япония", "Сэки Кадзуя", 7.6],
    ["Моя жизнь в другом мире с нуля", 2014, "Япония", "Таппэи Нагацуки", 8.3],
    ["Судьба/Ночь схватки", 2006, "Япония", "Тип-Мун", 8.5],
    ["Книга магии", 2016, "Япония", "Сюго Сакураи", 7.9],
    ["Сила воли", 2013, "Япония", "Кинкэй", 8.0],
    ["Светлячок в ночи", 2018, "Япония", "Мицука Сэно", 7.8],
    ["Пробуждение дракона", 2017, "Япония", "Тадзимэ Кадзухиро", 8.1],
    ["Люди в черном", 2015, "Япония", "Кодзима Хидэаки", 7.7],
    ["Тайная жизнь в школе", 2019, "Япония", "Хиросэ Мицуки", 8.2],
    ["Золотая эпоха", 2014, "Япония", "Хаято Кавасэ", 7.5],
    ["Кровавая луна", 2016, "Япония", "Сэкидзуми Рю", 8.0],
    ["Пробуждение магии", 2013, "Япония", "Суда Сатоси", 7.9],
    ["Дорога к славе", 2015, "Япония", "Такэси Мураками", 8.3],
    ["Сквозь время", 2017, "Япония", "Хироши Наги", 8.4],
    ["Легенда о героях", 2011, "Япония", "Кодзима Рю", 8.1],
    ["В поисках силы", 2018, "Япония", "Тору Ханэда", 7.6],
    ["Зов предков", 2016, "Япония", "Ханэда Сигэру", 8.0],
    ["Свет в конце тоннеля", 2019, "Япония", "Сэко Хироши", 8.2],
    ["Сказания о древних", 2015, "Япония", "Кодзима Сэцу", 8.1],
    ["Мир за гранью", 2014, "Япония", "Токихиро Хаясэ", 7.8],
    ["Путь воина", 2017, "Япония", "Сэкидзуми Хару", 8.3]
]




def index(request):
    return HttpResponse("<h1>mane</h1>")
def about(request):
    html = ''
    for i in range(len(ranobe_list)):
        html+="<tr>"
        for j in range(len(ranobe_list[0])):

            a = ranobe_list[i]
            html+= f"<div>{a}</div>"

    return HttpResponse(html)
def contact(request):
    return HttpResponse("<h1>+7**********</h1>")
